app/views/quotes/_form.html.erb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."first_name" = ? LIMIT ?  [["first_name", "Heraclitus"], ["LIMIT", 1]]
---
    <%= f.label :philosopher_id, "Philosopher", class: "form-label" %>
    <%= f.select :philosopher_id, Philosopher.all.collect { |phil| ["#{phil.first_name} #{phil.last_name}", phil.id] }, { include_blank: true, selected: Philosopher.find_by(first_name: 'Heraclitus')&.id }, class: "form-control" %>

SELECT "categories"."id" FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 3]]
---
    <%= f.label :category_ids, "Category", class: "form-label" %>
    <%= f.collection_select :category_ids, Category.all, :id, :category_name, { include_blank: true }, { class: "form-control" } %>