app/views/quotes/show.html.erb

      <p class="card-text"><strong>Quote Content:</strong> <%= @quote.text %></p>
      <p class="card-text"><strong>Philosopher:</strong> <%= @quote.philosopher.first_name %> <%= @quote.philosopher.last_name %></p>
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      <p class="card-text"><strong>Comment:</strong> <%= @quote.comment %></p>
      <p class="card-text"><strong>Category:</strong> <%= @quote.categories.map(&:category_name).join(", ") %></p>
---
SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 3]]