app/views/quotes/your_quotes.html.erb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        <div class="card-body">
          <h2 class="card-title"><%= quote.philosopher.first_name %> <%= quote.philosopher.last_name %></h2>

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 3]]
---
          <p class="card-text"><strong>Comment:</strong> <%= quote.comment %></p>
          <p class="card-text"><strong>Category:</strong> <%= quote.categories.map(&:category_name).join(", ") %></p>