app/views/search/index.html.erb

        <div class="card-body">
          <h4 class="card-title"><%= quote.user.first_name %> <%= quote.user.last_name %></h4>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

            <%= quote.text %><br />
            <strong>Philosopher:</strong> <%= quote.philosopher.first_name %> <%= quote.philosopher.last_name %><br />
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]