app/views/home/index.html.erb

        <h2 class="display-6"><%= quote.text %></h2>
        <h4 class="card-title mt-3"><%= quote.philosopher.first_name %> <%= quote.philosopher.last_name %></h4>
        <p class="card-text">
          <small><strong>Submitted by:</strong> <%= quote.user.first_name %> <%= quote.user.last_name %></small><br />
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]