app/views/home/uquotes.html.erb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    <div class="card-body">
      <h4 class="card-title"><%= quote.philosopher.first_name %> <%= quote.philosopher.last_name %></h4>