app/controllers/home_controller.rb

  def index
    @quotes = Quote.where(is_public: true).order(created_at: :desc).limit(5)
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = ? ORDER BY "quotes"."created_at" DESC LIMIT ?  [["is_public", 1], ["LIMIT", 5]]

  def set_user
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]