app/controllers/quote_categories_controller.rb

SELECT "quote_categories".* FROM "quote_categories"
---
  def index
    @quote_categories = QuoteCategory.all