app/controllers/quotes_controller.rb

INSERT INTO "quotes" ("text", "publication_year", "is_public", "user_id", "philosopher_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quote = current_user.quotes.build(quote_params)
    if @quote.save

UPDATE "quotes" SET "text" = ?, "comment" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["text", "imanka264@gmail.comsw"], ["comment", "imanka264@gmail.coms"], ["updated_at", "2024-05-21 13:03:20.335344"], ["id", 15]]
---
  def update
    if @quote.update(quote_params)

DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 5]]
---
  def destroy
    @quote.destroy

SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = ? ORDER BY "quotes"."created_at" DESC  [["is_public", 1]]
---
  def index
    @quotes = Quote.where(is_public: true).order(created_at: :desc)

SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ? ORDER BY "quotes"."created_at" DESC  [["user_id", 8]]
---
  def your_quotes
    @quotes = current_user.quotes.order(created_at: :desc)

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_quote
    @quote = Quote.find(params[:id])