app/controllers/search_controller.rb

  def index
    keyword_query = params[:keyword_query] # Retrieves the keyword
    if keyword_query.present?
      # Searches for quotes matching the keyword query in philosopher's first name, last name, or quote text
      @quotes = Quote.joins(:philosopher).where("philosophers.first_name LIKE ? OR philosophers.last_name LIKE ? OR quotes.text LIKE ?", "%#{keyword_query}%", "%#{keyword_query}%", "%#{keyword_query}%").distinct
---
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories"."category_id" WHERE (categories.category_name LIKE '%We are%' OR quotes.text LIKE '%We are%')