app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@myquotes.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "imanka8634@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:email]) # Finds user by email
    if user && user.authenticate(params[:password]) && user.status == "Active"
      session[:user_id] = user.id # Sets user ID in session
      session[:first_name] = user.first_name # Sets user's first name in session