app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if logged_in? && is_administrator?
      @users = User.all

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "status", "is_admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.status ||= 'Active'
    if @user.save

UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "imanka826224@gmail.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2024-05-21 13:34:56.288395"], ["id", 15]]
---
  def update
    if @user.update(user_params)